[
    {
        "Week": "1 and 2",
        "Heading" : "Folic Acid (Vitamin B9)",
        "What it is": "folic acid (called folate in food form) — the B-9 vitamin you’ll want to add to your plate throughout your nine months. It plays a key role in the production of your baby's heart and circulatory system (including the production of red blood cells) and helps develop your budding baby’s brain and spinal cord. Research has also found that getting your fill of folic acid in the first 30 days of pregnancy can help reduce the risk of neural-tube defects such as spina bifida, and also helps prevent early miscarriage and premature delivery.",
        "Why you need it:" : "Because most birth defects develop in the first few weeks of pregnancy, it’s important to load up as early as possible.",
        "How much you need daily:" : "400 mcg starting at least one month before conception and 400-600 mcg from all sources throughout all nine months of pregnancy and while breastfeeding",
        "Where you can get your fill:" : "Aside from the 400 mcg in your daily prenatal vitamin, you can get ample amounts of folate from oranges, strawberries, green leafy vegetables, fortified breakfast cereals, beans, nuts, cauliflower and beets."

    },

    {
        "Week": "3",
        "Heading" : "Vitamin-C",
        "What it is": "Also known as ascorbic acid, C is a water-soluble vitamin needed to make collagen, a vital protein that aids our blood vessels, cartilage, tendons and bones.",
        "Why you need it:" : "Vitamin C is an essential nutrient you need every single day, and pregnancy is no exception. The human body is unable to produce it naturally, but this incredible nutrient can do so much to help your and your baby's bodies. So it's up to you to work it into your diet! There are some studies that link low blood levels of vitamin C and preeclampsia, which is why there’s an increased need when you're expecting. Vitamin C is also an antioxidant that helps protect the body by providing and bolstering immunity, and, on top of it all, it helps you absorb iron.",
        "How much you need daily:" : "85 mg",
        "Where you can get your fill:" : "Oranges, broccoli, strawberries, green chiles, red bell pepper, guava, papaya, kiwi, sweet potato, pineapple, grapefruit"

    },

    {
        "Week": "4",
        "Heading" : "Calcium",
        "What it is": "Calcium is the most abundant mineral in the body. Ninety-nine percent is stored in the bones and teeth and less than 1 percent finds a home in your muscles, blood, tissues and other bodily fluids.",
        "Why you need it:" : "Your growing baby takes all the calcium she needs from your body, mainly for the development of her bones and teeth. That means if you’re not getting the right amounts, your body will leach the calcium from your bones to give to baby, making you more susceptible to osteoporosis (brittle bones). But don't worry. It's easy and yummy to work calcium into your diet.",
        "How much you need daily:" : "1,000 mg",
        "Where you can get your fill:" : "Milk, yogurt, cheese, calcium-fortified orange juice, salmon, tofu, sardines (canned, with bones)"

    },
    {
        "Week": "5 and 6",
        "Heading" : "Potassium",
        "What it is": "This mineral that’s found in many delicious food sources is one of seven essential macrominerals, along with calcium, magnesium, phosphorus, sodium, chloride and sulfur. It’s tasked with maintaining proper organ function.",
        "Why you need it:" : "Potassium works with sodium to maintain proper fluid balance in cells, which is ever-important during pregnancy. Now that your body is working for two, your fluid levels need to increase significantly. Potassium also regulates blood pressure, and high blood pressure is a characteristic of preeclampsia, and is known to help your body maintain proper muscle tone (meaning fewer aches, pains and cramping for Mommy-to-be!).",
        "How much you need daily:" : "If 18 and younger, 2,600 mg, and if 19 and older, 2,900 mg",
        "Where you can get your fill:" : "Bananas, wheat bran, avocados, dried apricots, oranges, peaches, pears, prunes, carrots, lentils, lima beans, peanuts, peas, sweet potatoes"

    },
    {
        "Week": "7",
        "Heading" : "Iodine",
        "What it is": "A trace element that’s found in food and plays a big role in brain development and the creation of thyroid hormones.",
        "Why you need it:" : "Iodine is one of the most important minerals a fetus needs for brain and nervous system development. It also helps maintain normal function of the thyroid, a gland in the base of your neck that regulates the hormones that control core body functions, including metabolism, heart rate and body temperature. Iodine does so much for your body, but it's easy to get the amount you need. Deficiency of iodine during pregnancy is the most preventable cause of intellectual disability in the world, according to the World Health Organization (WHO) and the Centers for Disease Control and Prevention (CDC). Keep your growing baby on track by adding some of these yummy things to your diet.",
        "How much you need daily:" : "150-250 mcg and no more than 1,100 mcg, as intake of this amount has been linked to thyroid cancer, according to the National Institutes of Health (NIH)",
        "Where you can get your fill:" : "Baked cod, plain yogurt, milk, shrimp, egg, canned light tuna, creamed corn, cheddar cheese and iodized table salt"

    },
    {
        "Week": "8 and 9",
        "Heading" : "Docosahexaenoic Acid (DHA)",
        "What it is": "DHA is one of the omega-3 fatty acids that is found throughout the body, mainly in the brain and eyes.",
        "Why you need it:" : "DHA is a key omega-3 fatty acid for visual and mental development of the fetus and newborn infant. Around week 8, your baby’s eye structure is becoming more complex, and the retina — the layer of tissue at the back of the eye that perceive and process light — are beginning to form, making it an excellent time to bulk up on DHA.",
        "How much you need daily:" : "200-300 mg",
        "Where you can get your fill:" : "Salmon, tuna, fortified eggs, sardines"

    },
    {
        "Week": "10 and 11",
        "Heading" : "Fiber",
        "What it is": "Fiber is among the most helpful nutrients you'll be getting into your pregnancy diet. This plant-based nutrient is best known for making sure food moves efficiently throughout your body, delivering other vitamins and minerals along to the organs that need them.",
        "Why you need it:" : "Fiber-rich foods are especially vital and useful during pregnancy. They help prevent glucose intolerance, a condition that can sometimes lead to gestational diabetes and fiber reduces the risk of high blood pressure and preeclampsia. But the perk Mom might like the best: Fiber can help with pesky pregnancy constipation.",
        "How much you need daily:" : "25-35 grams",
        "Where you can get your fill:" : "Lentils, black beans, lima beans, brown rice, broccoli, peas"

    },
    {
        "Week": "12 and 13",
        "Heading" : "Water",
        "What it is": "While water isn’t a nutrient that provides calories, staying well-hydrated throughout pregnancy is a must.",
        "Why you need it:" : "Water helps keep the body hydrated and functioning at its peak. It also aids in delivering all the nutrients, vitamins and minerals from the healthy food you eat and those prenatal vitamins you take to your growing baby.More water intake is also great for a mommy-to-be. Water aids in everything from hormonal and temperature balance to digestion and absorption of nutrients. Sufficient fluids can help prevent UTIs, bladder infections, headaches, fatigue, constipation and hemorrhoids.",
        "How much you need daily:" : "It can vary widely from person to person, so ask your practitioner what's right for you, but a general range is eight to 10 8-ounce glasses from all sources",
        "Where you can get your fill:" : "Water, milk, sparkling or flavored waters, fruit and vegetable juices (just watch out for added sugar in fruit juice and added sodium in veggie drinks)"

    },
    {
        "Week": "14 and 15",
        "Heading" : "Magnesium",
        "What it is": " Magnesium is an essential mineral that helps regulate almost every system in the body. It works in combination with calcium to relax and contract muscles.  ",
        "Why you need it:" : "In addition to strengthening baby’s bones and teeth, magnesium works to stimulate enzyme function, regulate insulin and control blood sugar levels. If you’re deficient in magnesium, you may feel fatigued and lack muscle strength (as if you needed any more of that these days). Other severe consequences can include poor fetal growth or preeclampsia.",
        "How much you need daily:" : "If you’re 18 or younger, 400 mg, and if you’re older than 19, 350-360 mg",
        "Where you can get your fill:" : "Almonds, spinach, cashews, peanuts, black beans, edamame, peanut butter, avocado, yogurt, kidney beans"

    },
    {
        "Week": "16 and 17",
        "Heading" : "Zinc",
        "What it is": "Zinc is considered an essential trace mineral because very small amounts of it are necessary for human health. That said, it is essential in helping the body’s immune system fight invading bacteria and viruses. The body also needs it for the creation of proteins and DNA.",
        "Why you need it:" : "Getting enough zinc during pregnancy is important for cell growth and the creation of your little one’s own genetic makeup. In helping to support your immune system, it also keeps you healthy by fighting the flu and other pesky illnesses that can plague you even during pregnancy. In addition, inadequate zinc intake is linked to low-birth-weight babies and other problems in labor and delivery.",
        "How much you need daily:" : "11 mg",
        "Where you can get your fill:" : "Lean beef, dark turkey meat, pork, yogurt, cashews, baked beans, almonds, peanuts"

    },
    {
        "Week": "19 and 20",
        "Heading" : "Iron",
        "What it is": " When you're expecting, you need to pump up the iron! No, we don't mean lifting weights (though that's good too when done carefully and in moderation); we're talking about the mineral. Iron is part of the protein hemoglobin, found in red blood cells. It's in charge of transferring oxygen from the lungs to the tissues and then returning carbon dioxide from the tissues back to the lungs. What's more, iron plays a role in growth, development, cell functioning, and the creation of hormones and connective tissue.",
        "Why you need it:" : "During pregnancy, there’s an increased demand for iron related to volume increases of red blood cells. The mineral also helps carry oxygen through the body, which is important for both Mom and baby. By week 20, your stored iron supply is just about depleted, right around the time your baby is most in need of new red blood cells, which puts you at risk for anemia, or low iron levels. That’s why it’s more important than ever to up your intake this week; in fact, your practitioner may suggest you take an iron supplement in addition to your prenatal vitamin and other food sources of iron. Iron can be absorbed more easily by the body when eaten with vitamin-C rich foods, such as citrus fruits and tomatoes.",
        "How much you need daily:" : "27 mg (check with your practitioner to make sure you’re getting enough)",
        "Where you can get your fill:" : "Chicken, beef, whole eggs, spinach, kale, beans, edamame"

    },
    {
        "Week": "21",
        "Heading" : "Phosphorus",
        "What it is": "After calcium, phosphorus is the second most abundant mineral in your body and 85 percent of it is found in your bones.",
        "Why you need it:" : "Phosphorus is very important for most bodily functions, namely muscle movement, blood clotting, and kidney and nerve function, as well as tissue and cell repair. Getting your fill during pregnancy means your baby-to-be is getting hers, too.",
        "How much you need daily:" : "If you’re 18 or younger, 1,250 mg, and if you’re older than 19, 700 mg",
        "Where you can get your fill:" : " Salmon, milk, yogurt, lentils, almonds, peanuts, eggs, whole wheat bread"

    },
    {
        "Week": "22",
        "Heading" : "Protien",
        "What it is": "Protein is the basic material of all living cells. It’s made up of amino acids and is a key component in all the tissues of the body, helping to repair and build muscle, bone, skin, hair, nails and blood. It’s also involved in creating and regulating hormones, enzymes and chemical reactions within our bodies.",
        "Why you need it:" : "Protein is made up of the amino acids that are the building blocks of human cells, responsible for constructing your baby’s beautiful face and cute little body. Towards the middle to end of your pregnancy, protein is even more important as your baby’s organs begin to transform. You’ll also want to make sure that you’re continuing to get your daily dose of vitamin B6, which helps break down protein.",
        "How much you need daily:" : "75 grams",
        "Where you can get your fill:" : "Meat, poultry, eggs, milk, cheese, beans, nuts, yogurt"

    },
    {
        "Week": "23",
        "Heading" : "Sodium",
        "What it is": "It has a bad reputation and a delicious flavor, but sodium is much more than the seasoning on potato chips. Sodium is one of two minerals found in table salt that works to regulate the body’s fluid, temperature and pH levels. While it’s added to various foods for flavor, without enough sodium, your muscles, nerves and organs wouldn’t function properly.",
        "Why you need it:" : "You're probably most used to hearing reasons why you should lower your sodium intake, which is important to consider. But sodium shouldn’t be off-limits during pregnancy. Because your body’s fluid levels increase when you're expecting, sodium comes in handy to keep it all in balance.",
        "How much you need daily:" : "1,500 mg (and no more than 2,300 mg)",
        "Where you can get your fill:" : "Vegetables, milk, eggs, plain yogurt, poultry, fish, fruit, grains, unsalted nuts"

    },
    {
        "Week": "24",
        "Heading" : "Vitamin E",
        "What it is": "A fat-soluble vitamin with a boost of antioxidant power, vitamin E helps protect your body’s cells from damage caused by free radicals in your environment — think air pollution, cigarette smoke, UV rays from the sun, etc.",
        "Why you need it:" : "It helps your body form and use red blood cells and muscles, all crucial for your budding baby-to-be. While vitamin E deficiency isn’t common in healthy adults, especially those in developing countries, research has found that sufficient vitamin E during pregnancy can help reduce the chances of developing preeclampsia.",
        "How much you need daily:" : "15 mg",
        "Where you can get your fill:" : "Green, leafy veggies like spinach, eggs, fortified cereals, nuts, seeds"

    },
    {
        "Week": "25",
        "Heading" : "Manganese",
        "What it is": "It might sound like a foreign language, but manganese is, in fact, a mineral — one that helps your body convert macronutrients into usable energy. ",
        "Why you need it:" : "Your body is working hard to create bone and cartilage for your growing baby, which is made possible in part by manganese. It also plays a role in the metabolism of carbohydrates, amino acids and cholesterol that your baby needs to grow, and helps protect those brand new cells from damage.",
        "How much you need daily:" : "2 mg",
        "Where you can get your fill:" : "Pecans, brown rice, oatmeal, spinach, pineapple, almonds, whole wheat bread, peanuts, legumes, carrots, broccoli, whole grains, bananas, raisins"

    },
    {
        "Week": "26 and 27",
        "Heading" : "Selenium",
        "What it is": "An essential trace mineral and an antioxidant important in reproduction, thyroid hormone metabolism, DNA synthesis, and protection from oxidative damage and infection.",
        "Why you need it:" : "Selenium is like the armor of your body. It is an important defense mechanism against disease, as it's highly involved in the regulation of your immune system and thyroid function. Some studies have shown that selenium supplementation during pregnancy decreased the risk of thyroid function abnormalities for women after pregnancy.",
        "How much you need daily:" : "60 mcg",
        "Where you can get your fill:" : "Brazil nuts, tuna, sardines, whole-grain breads, grass-fed beef, turkey, chicken, lamb"

    },
    {
        "Week": "28",
        "Heading" : "Omega-3 Fatty Acids",
        "What it is": "Not all fats are bad fats, especially omega-3 fatty acids, which fight inflammation, reduce blood pressure, and increase the good kind of cholesterol (HDL) while lowering the bad (LDL).",
        "Why you need it:" : "When it comes to your baby, omega-3s help develop and sustain the health of her growing heart, immune system, brain and eyes, especially during the third trimester when baby's brain growth is at its peak. Research has even found that getting enough omega-3s during pregnancy, the most notable being DHA, may help fight postpartum depression, regulate pregnancy-related mood swings, and reduce the risk of preterm birth and very low birth weight.",
        "How much you need daily:" : "200-300 mg",
        "Where you can get your fill:" : "salmon, trout, cod, DHA-rich eggs, walnuts, flax seed, sardines, anchovies, arugula, shrimp, crab, grass-fed beef, free-range chicken, canned light tuna (just limit your intake to around 6 oz a week and steer clear from the more mercury-rich albacore variety)"

    },
    {
        "Week": "29",
        "Heading" : "Vitamin B5 (Pantothenic Acid)",
        "What it is": "Vitamin B5, also known as pantothenic acid, is a water-soluble vitamin found in plant and animal sources that’s necessary for our body to properly use and break down carbohydrates, proteins and lipids. It also regulates our body’s adrenal activity, is involved in the production of antibodies, and it may stimulate wound healing (which also makes it contribute to healthy skin and hair).",
        "Why you need it:" : "Because of the large role it plays in the synthesis of vitamins, cholesterol, amino acids and fatty acids, this nutrient is used by your baby to grow and develop so that he'll be ready to meet you come delivery day.",
        "How much you need daily:" : "6 mg",
        "Where you can get your fill:" : "Peas, beans, lean meat, poultry, fish, milk, broccoli, avocados, whole grains, cereals, sunflower seeds"

    },
    {
        "Week": "30",
        "Heading" : "Choline",
        "What it is": "Choline is a vitamin-like essential nutrient that’s involved in many physiological processes, including the production of neurotransmitters in the brain. It’s also needed to make phospholipids, which help with the structure of cell membranes.",
        "Why you need it:" : "Choline is vital for fetal brain development — specifically the memory center of the brain. It can also affect cognition later in life — good for the aging brain too! Some studies have shown adequate choline intake during pregnancy decreases the risk of neural-tube defects.",
        "How much you need daily:" : "450 mg",
        "Where you can get your fill:" : "Eggs, lean beef, salmon, chicken, broccoli, cauliflower"

    },
    {
        "Week": "31",
        "Heading" : "Water",
        "What it is": "Water isn't a nutrient packed with calories you and your growing baby need, but it is vital to get enough of it throughout your pregnancy. Staying properly hydrated during all nine months is incredibly important, partly because of your body's higher blood volume.",
        "Why you need it:" : "Water keeps you hydrated and helps your body and your baby's function properly. It also helps deliver the vitamins and minerals from your food and prenatal vitamins to your baby and aids in the absorption of those nutrients. Water also keeps your temperature balanced and your digestive system running smoothly.",
        "How much you need daily:" : "It can vary widely depending on the person, so ask your practitioner what's right for you, but a general range is eight to 10 8-ounce glasses from all sources",
        "Where you can get your fill:" : "Water, sparkling or flavored waters, fruit and vegetable juices (but check for added sugar in fruit juice and added sodium in veggie drinks), milk"

    },
    {
        "Week": "32 and 33",
        "Heading" : "Protein",
        "What it is": "Protein makes up the building blocks of your baby's cells and is especially important this week and for the second half of your pregnancy. It's the foundation of all the tissues in the body, repairing and building muscle, bone, skin, hair, nails and blood. It’s also involved in making and regulating hormones and enzymes.",
        "Why you need it:" : "Protein consists of the amino acids that create your baby’s body and face. It becomes even more important mid-pregnancy and beyond as your baby’s organs begin to take shape. Make sure you're getting the recommended daily amount of vitamin B6, which helps break down proteins into amino acids.",
        "How much you need daily:" : "75 grams",
        "Where you can get your fill:" : "Meat, poultry, eggs, milk, cheese, beans, nuts"

    },
    {
        "Week": "34 and 35",
        "Heading" : "Molybdenum",
        "What it is": "Molybdenum is a micronutrient, meaning the body only needs it in small amounts. It’s found in several tissues of the body and is required for eliminating toxic substances.",
        "Why you need it:" : "Pregnant and nursing moms should be careful not to supplement with more molybdenum than their diet provides, as some research shows that excess amounts can be linked to adverse health effects.",
        "How much you need daily:" : "50 mcg",
        "Where you can get your fill:" : "Lentils, dried peas, lima beans, kidney beans, soybeans, black beans, garbanzo beans, oats, barley"

    },{
        "Week": "36",
        "Heading" : "Iron",
        "What it is": "Iron is an important mineral that’s part of the protein hemoglobin, which is found in red blood cells and is tasked with transferring oxygen from the lungs to the tissues and returning carbon dioxide from the tissues back to the lungs. Additionally iron plays a role in growth, development, cell functioning, and building hormones and connective tissue.",
        "Why you need it:" : "It’s normal to be tired (or downright exhausted) by the time you hit your 36th week of pregnancy, which may be in part due to your body’s increased demand for iron. Iron also plays a key role by helping carry oxygen through the body for both Mom and baby, which your little one needs more than ever now that she’s nearly full grown.",
        "How much you need daily:" : "27 mg (or higher, depending on your iron levels; check with your practitioner to make sure you're getting enough)",
        "Where you can get your fill:" : "Chicken, beef, whole eggs, spinach, kale, beans, edamame"

    },
    {
        "Week": "37",
        "Heading" : "Calcium",
        "What it is": "Calcium is the most abundant mineral in the body, with 99% stored in the bones and teeth and less than 1% in the muscles, blood and other tissues",
        "Why you need it:" : "Your baby-to-be takes all the calcium he needs from your body, primarily for the growth of his bones and teeth. What that means is if you’re not getting the right amounts in your diet, your body will leach the calcium from your own bones and teeth to give to baby. That, in turn, makes you more susceptible to osteoporosis, a condition causing brittle bones.",
        "How much you need daily:" : "1,000 mg for pregnant women 19 and older (1,300 mg for pregnant women between ages 14 and 18) ",
        "Where you can get your fill:" : "Milk, yogurt, cheese, calcium-fortified orange juice, salmon, tofu, sardines, kale and other leafy greens, broccoli"

    },
    {
        "Week": "38",
        "Heading" : "Omega-6 Fatty Acids",
        "What it is": "While omega-6 fatty acids are essential for human health, our body cannot create them on its own, meaning our only means of getting them is through food.",
        "Why you need it:" : "Along with omega-3 fatty acids, omega-6 fatty acids play an important role in your baby-to-be’s brain function, as well as physical growth and development. As they're a particular type of polyunsaturated fatty acid (PUFA), omega-6s also are important for skin, hair and bone growth as well as for maintaining proper functioning of the reproductive system and the body’s metabolism levels.",
        "How much you need daily:" : "13 grams",
        "Where you can get your fill:" : "Vegetable oil, walnuts, sesame seeds, pine nuts, Brazil nuts, pecans, pumpkin seeds, almonds"

    },
    {
        "Week": "39",
        "Heading" : "Copper",
        "What it is": "Copper is an essential trace mineral and micronutrient necessary for the proper growth, development and maintenance of bone, connective tissue, brain, heart and organ tissue.",
        "Why you need it:" : "Copper is especially important during pregnancy, when your blood supply doubles and your energy levels drop. This trace element also helps in creating your baby’s heart, blood vessels and cells, and nervous, immune and skeletal systems.",
        "How much you need daily:" : "1,000 mcg",
        "Where you can get your fill:" : "Sunflower seeds, hazelnuts, cashews and other nuts; crab meat; shiitake mushrooms; lentils; cocoa; whole grains; prunes; black pepper"

    },
    {
        "Week": "40",
        "Heading" : "Fiber",
        "What it is": "This plant-based nutrient makes sure food moves efficiently throughout your body, delivering other nutrients along to the organs that need them.",
        "Why you need it:" : "Fiber-rich foods are especially helpful during pregnancy, as they work to help regulate blood sugar levels and prevent gestational diabetes. Plus, fiber can lower the risk of high blood pressure and may help protect against preeclampsia. An added bonus of continuing to get enough fiber during all 40 (or 40-plus) weeks of pregnancy? It does wonders for an unsettled tummy and the constipation that often plagues expectant moms.",
        "How much you need daily:" : "25-35 grams",
        "Where you can get your fill:" : "Whole grain breads, tortillas and waffles; cereals made with whole grains and oats; black and lima beans; brown rice, quinoa and lentils; greens including broccoli and peas; various fresh fruits; bran mixed into everything from burgers to yogurt smoothies; whole wheat pasta; baked potato wedges with the skins on"

    }
    
]
