[
    {
        "Symptom": "Urinary Frequency",
        "What is it?" : "Increased urinary frequency is an early symptom of pregnancy in women. It’s caused by an increase of the hormones progesterone and human chorionic gonadotropin. The urges tend to reduce in the second trimester. The uterus is also higher in the second trimester. This results in less pressure on your bladder.",
        "What to do?": "If you’re experiencing urinary frequency in pregnancy, you’ll feel the need to urinate more often. Sometimes you may go to the bathroom, but urinate very little, if at all. You may also experience urinary leakage while pregnant. This leakage may occur when you:- (cough , exercise , laugh , sneeze). It’s important to note that sometimes urinary frequency symptoms can indicate an underlying urinary tract infection (UTI). Women are more likely to experience UTIs during pregnancy. In addition to symptoms of urinary frequency or urgency, other UTI symptoms include:-\n (1) Urine that appears cloudy \n (2) Urine that is red, pink, or concentrated \n (3) Urine that has a strong or foul smell \n (4) A burning sensation when urinating \n (5) Pain when urinating \nIf you have these symptoms, tell your doctor. An untreated UTI could progress up the urinary tract and cause more serious symptoms."

    },

    {
        "Symptom": "Tiredness",
        "What is it?" : "It’s common to feel tired, or even exhausted, during pregnancy, especially in the first 12 weeks or so. Hormonal changes taking place in your body at this time can make you feel tired, nauseous and emotional. ",
        "What to do?": "The only answer is to try to rest as much as possible. Make time to sit with your feet up during the day, and accept any offers of help from colleagues and family. Being tired and run-down can make you feel low. Try to look after your physical health by eating a healthy diet and get plenty of rest and sleep. Later in pregnancy, you may feel tired because of the extra weight you are carrying. Make sure you get plenty of rest. As your baby gets bigger, it can be difficult to get a good night’s sleep. You might find it uncomfortable lying down or, just when you get comfortable, you have to get up to go to the toilet. Feeling tired won’t harm you or your baby, but it can make life feel more difficult, especially in the early days before you’ve told people about your pregnancy. Make sure you get as much rest as you can."

    },
    {
        "Symptom": "Poor Sleep",
        "What is it?" : "Most women experience sleep problems during pregnancy. Pregnant women tend to get more sleep during their first trimesters (hello, early bedtime) but experience a big drop in the quality of their sleep. It turns out that pregnancy can make you feel exhausted all day long. It can also cause insomnia at night.",
        "What to do?": "Poor sleep can adversely affect health, and it also has a critical impact on pregnant women, potentially leading to maternal complications such as hypertension and gestational diabetes. So, if you are unable to get proper sleep then make sure to contact your Doctor and take the necessary consultation."

    },
    {
        "Symptom": "Back Pain",
        "What is it?" : "It is very common to get backache or back pain during pregnancy, especially in the early stages. During pregnancy, the ligaments in your body naturally become softer and stretch to prepare you for labour. This can put a strain on the joints of your lower back and pelvis, which can cause back pain.",
        "What to do?": "Normally proper rest and exercise can help you ineasing out the back pain. If your backache is very painful, talk to your GP or midwife. They may be able to refer you to an obstetric physiotherapist at your hospital, who can give you advice and may suggest some helpful exercises.Contact your GP or midwife as soon as possible if you have back pain and you: (1) Are in your second or third trimester – this could be a sign of early labour ,  (2) Also have a fever, bleeding from your vagina or pain when you pee , (3) Lose feeling in one or both of your legs, your bum, or your genitals , (4) Have pain in one or more of your sides (under your ribs)"

    },
    {
        "Symptom": "Vaginal Discharge",
        "What is it?" : "One of the earliest signs of pregnancy is an increase in vaginal discharge, and this continues throughout pregnancy. When a woman becomes pregnant, her vagina largely takes on a personality of its own. Normal vaginal discharge, known as leukorrhea, is thin, clear, or milky white, and mild smelling. Changes in vaginal discharge can begin as early as one to two weeks after conception, even before you’ve missed your period. As your pregnancy progresses, this discharge usually becomes more noticeable, and it’s heaviest at the end of your pregnancy.",
        "What to do?": "Abnormal discharge may be a sign of infection. Yeast infections are common during pregnancy. If you develop a yeast infection during pregnancy, your doctor may recommend a vaginal cream or suppository. Call your healthcare provider immediately if you have bright red discharge that exceeds an ounce. This could be a sign of placenta previa or placental abruption."

    },
    {
        "Symptom": "Forgetfulness",
        "What is it?" : "Pregnancy-induced brain fog is a true (and truly frustrating) hallmark of pregnancy. If you suffer from so-called “pregnancy brain,” you may forget appointments, what you just walked into the store for, where you left your purse, whether you turned off the stove — and, maybe, your phone number. It is normal",
        "What to do?": "Forgetfulness is both completely normal and extremely common. Even if you pride yourself on your master multitasking skills or your ability to stay organized, you still may find yourself having trouble concentrating or remembering your car keys. The good news is it’s also temporary — you'll have total recall again long before you start to have your senior moments."

    },
    {
        "Symptom": "Headaches",
        "What is it?" : "Headaches are one of the most common discomforts experienced during pregnancy and may occur at any time during your pregnancy, but they tend to be most common during the first and third trimesters. During the first trimester, your body experiences a surge of hormones and an increase in blood volume.  These two changes can cause more frequent headaches. These headaches may be further aggravated by stress, poor posture or changes in your vision.",
        "What to do?": "During pregnancy, you want to try and relieve your headache by natural means if possible, however your health care provider may recommend acetaminophen. You may contact your doctor if you feel that your headache is worsening"

    },
    {
        "Symptom": "Vivid Dreams",
        "What is it?" : "Women report having much more vivid and colorful dreams during pregnancy than they ever did before. This may be due to those wild hormonal fluctuations you're experiencing, which can make your emotions (even when you're sleeping) and your dreams more intense now.",
        "What to do?": "Vivid dreams are a normal part of a pregnant ladies routine. There is nothing to worry abou it. "

    },
    {
        "Symptom": "Taste Smell Changes",
        "What is it?" : "Dysgeusia, or a change in your sense of taste, during pregnancy likely is caused by pregnancy hormones. It may cause you to hate a food that you normally love, or enjoy foods you normally dislike. Sometimes it can cause a sour or metallic taste in your mouth, even if you're not eating anything.",
        "What to do?": "Taste change is normal and there is nothing to worry about regarding this."

    },
    {
        "Symptom": "Changes in Nipples",
        "What is it?" : "From the beginning of your pregnancy, there are breast changes you should expect. These changes are normal because your breasts are evolving and preparing for the arrival of your baby.",
        "What to do?": "Very common lumps found among women during pregnancy are clogged milk ducts. These are red, tender-to-the-touch, hard lumps in your breasts. Warm compresses (running warm water over your breasts in the shower or applying a warm washcloth) and massages will probably clear the duct in a few days. If you are unsure of any new lump, tell your doctor on your next visit."

    },
    {
        "Symptom": "Nausea",
        "What is it?" : "Nausea and vomiting in pregnancy, often known as morning sickness, is very common in early pregnancy. It can affect you at any time of the day or night, and some women feel sick all day long. Morning sickness is unpleasant, and for some women it can significantly affect their day-to-day life. But it doesn't put your baby at any increased risk, and usually clears up by weeks 16 to 20 of your pregnancy.",
        "What to do?": "If you develop a severe form of pregnancy sickness called hyperemesis gravidarum. This can be serious, and there's a chance you may not get enough fluids in your body (dehydration) or not get enough nutrients from your diet (malnourishment). If you are unable to keep food for continuously 24 hours then immediately contact your Doctor."

    },
    {
        "Symptom": "Changes in Libido",
        "What is it?" : "Pregnancy can have a significant effect on a woman’s sex drive. Increases and decreases in libido are both normal, and arousal levels can change at different stages of pregnancy. It is normal for a woman’s sex drive to ebb and flow throughout pregnancy. These changes usually coincide with the physical and hormonal changes that occur each trimester.",
        "What to do?": "Unless an obstetrician or midwife advises otherwise, anal sex, vaginal sex, and masturbation are safe during pregnancy. An obstetrician might advise a woman to abstain from sex if she has a high risk of miscarriage or a history of preterm labor. Women can discuss any concerns that they have with their obstetrician."

    },
    {
        "Symptom": "Hip Pelvic Pain",
        "What is it?" : "As your baby grows, your uterus grows as much as 1,000 times its original size. So to help the body a Harmone is released - Relaxin. Relaxin, which does what it sounds like — it relaxes and loosens your joints and muscles to help the baby make its way out of your lower body. The added weight bearing down on loosened joints and ligaments can create all sorts of aches and pains — usually moderate, but in some cases severe.",
        "What to do?": "A good position to find relief any time of day is to simply sit backwards on a chair to take the pressure off your spine and relax your back. Also, make sure you keep your low back supported with pillows when sitting in a chair. Don't forget the importance of proper body alignment while you sleep. Always have something [a pillow or towel] between your knees to take the pressure off your lower back and hips, and use a good pillow to help keep your body aligned properly."

    }
    
]
